{
  "dialog": {
    "permissions": {
      "title": "Permissions",
      "text": "Can we access your microphone?"
    },
    "denied": {
      "title": "Ops!",
      "text": "We can't access your microphone right now. Please go to your browser settings to allow it."
    },
    "error": {
      "title": "Ops!",
      "text": "Unxpected error, Please get out and come again."
    },
    "microphones": {
      "title": " Select microphone"
    },
    "about": {
      "title": "About",
      "text": "# Active Tuner \n<sup>Versão: 1.1.6</sup>\n\nIt is an analyser of sound waves, to aid in the tuning of musical instruments. It detects frequencies between C₀ (16,35 Hertz) and B₈  (7902,13 Hertz), and shows a musical note  that matches the recognized frequency.\n\n## Disclaimer\n  - This application  depends on the functional capability of the sound devices employed on the hardware that runs it, like a microphone or sound interface.\n  - In tests, browsers like Chrome or  other Chromium based browsers, were more performant with graphic animation rendering.\n\n## Project goals\nThe Active Tuner aims at sound wave operations and its digital representation learning. It was necessary the basic understanding of analog to digital signal conversion algorithms. We also had to learn the browser&apos;s audio API, like Chrome and Firefox. Only then could we  build  a web application to be able to show a representation  of sound frequencies and their matching musical notes during the sound recording.\n\n## Technologies and tools\n### Web Audio API\n  - To record and reproduce the sound waves\n\n### Pitch detection algorithm - PDA\n  - To determine the frequency of a digital sound signal \n\n### Canvas API\n  - Used to  graphically show musical notes and frequencies hertz\n  - The best technology found for smooth and performant rendering, because of the high volume of data and time required to update notes and frequencies hertz on screen\n\n### React\n  - JavaScript/TypeScript Framework used to build the web application\n\n### Typescript/Javascript\n  - Language used to handle Web Audio API\n  - Perform calculations of detection pitch algorithm\n  - Building of the application with ReactJS\n\n## Contributors\n  - <a href=\"https://www.linkedin.com/in/renanlopes77/\" target=\"_blank\" rel=\"noopener\">Renan Lopes</a>\n  - <a href=\"https://www.linkedin.com/in/wesley-a/\" target=\"_blank\" rel=\"noopener\">Wesley Araujo</a>\n\n## Acknowledgments\n  - <a href=\"https://github.com/freirezinho\" target=\"_blank\" rel=\"noopener\">Saulo Freire</a>"
    }
  },
  "hook": {
    "useAudio": {
      "microphone-default": "Microphone of system",
      "microphone-name": "Microphone {{name}}"
    }
  },
  "buttons": {
    "okay": "Ok",
    "get-help": "Get help",
    "exit": "Exit",
    "close": "Close"
  }
}