{
  "dialog": {
    "permissions": {
      "title": "Permissões",
      "text": "Para continuar precisaremos acessar seu microfone, tudo bem ?"
    },
    "denied": {
      "title": "Ops!",
      "text": "Não tenho permissão para usar seu microfone. Por favor, libere nas configurações do seu navegador."
    },
    "error": {
      "title": "Ops!",
      "text": "Ocorreu um erro inesperado. Por favor, saia e entre novamente."
    },
    "microphones": {
      "title": "Microfones"
    }
  },
  "hook": {
    "useAudio": {
      "microphone-default": "Microfone do sistema",
      "microphone-name": "Microfone {{name}}"
    }
  },
  "about" : "# Active Tuner \n<sup>Versão: 1.0.0</sup>\n\nAnalisador de frequências sonoras, para auxílio na afinação de instrumentos musicais. Ele detecta frequências entre C₀ (16,35 Hertz) e B₈  (7902,13 Hertz), e exibe a nota referente a frequência captada.\n\n## Disclaimer\n  - Esse aplicativo se limita pela capacidade funcional do dispositivo de áudio a executá-lo, tanto o microfone quanto a placa de som e suas capacidades.\n  - Em testes, os navegadores Chrome e baseados em Chromium, tiveram melhor performance com a representação de animações gráficas.\n\n## Objetivos do projeto\nO Active Tuner tem como objetivo o aprendizado do funcionamento de ondas sonoras e sua representação digital. Foi necessário a compreensão básica de algoritmos para a conversão do sinal analógico para digital. O aprendizado do funcionamento da API de áudio utilizado pelos browsers, ex. Chrome e Firefox. E a construção de uma aplicação Web que pudesse representar a frequência e sua nota referente no momento da captação.\n\n## Tecnologias e Ferramentas\n\n### Web Audio API  \n  - Para captação e representação das ondas sonoras no navegador.\nAlgoritmo de detecção de pitch (Pitch detection algorithm - PDA)\n  - Utilizado para determinar a frequência de um sinal sonoro digital\n\n### Canvas API\n  - Utilizado para a representação gráfica das notas e das frequências;\n  - Melhor tecnologia encontrada para a fluidez da exibição, devido ao alto volume de dados e tempo demandado para a atualização das notas e frequências em tela.\n\n### React  \n  - Framework utilizado para a construção da aplicação web\n\n### Typescript/Javascript  \n  - Linguagem utilizada para a manipulação da Web Audio API\n  - Efetuar cálculos dos algoritmos de detecção de pitch a correlação;\n  - Construção da aplicação com React.\n\n## Desenvolvedores\n  - <a href=\"https://www.linkedin.com/in/renanlopes77/\" target=\"_blank\" rel=\"noopener\">Renan Lopes</a>\n  - <a href=\"https://www.linkedin.com/in/wesley-a/\" target=\"_blank\" rel=\"noopener\">Wesley Araujo</a>\n\n## Agradecimentos\n  - <a href=\"https://github.com/freirezinho\" target=\"_blank\" rel=\"noopener\">Saulo Freire</a>",
  "buttons": {
    "okay": "Ok",
    "get-help": "Obter ajuda",
    "exit": "Sair",
    "close": "Fechar"
  }
}